{
  "matching_results": 12975,
  "shockValue": 1.5,
  "results": [{
    "id": "x9blXqMrYqJ0r2mNe8F-hwKJ3iWAO_vODgB2xPG0xVngmNZZ7Hq6ERQOgIfX9LND",
    "score": 3.328906,
    "url": "http://www.breakingnewsforex.com/2017/08/17/are-gold-prices-on-the-verge-of-fresh-yearly-highs/",
    "host": "breakingnewsforex.com",
    "text": "Are Gold Prices on the Verge of Fresh Yearly Highs? · 17 August, 2017",
    "publication_date": "2017-08-17T17:31:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.56781,
          "label": "neutral"
        }
      }
    },
    "title": "Are Gold Prices on the Verge of Fresh Yearly Highs?"
  }, {
    "id": "3lElHFPV8TjQIuRDx8YcPfXnPNjW7vePlwGtzjsfYHh7Z8GXog9FtqK7SzczXdFv",
    "score": 3.2282379,
    "url": "https://www.moneyandmarkets.com/new-bull-market-gold-88104",
    "host": "moneyandmarkets.com",
    "text": "Is This a New Bull Market in Gold? David Dutkewych | Thursday, August 17, 2017 at 4:00 pm A little over a month ago, gold was deeply oversold. So I recommended that you either add to your gold positions or start a new position if you were not yet investing in gold. Well, almost as if on cue, gold headed straight up. It’s still up 4.6% since then, even after its current pullback. But, it’s not just me recommending gold: The manager of the world’s largest hedge fund at Bridgewater Associates, Ray Dalio, also recommends owning gold. In fact, he recently said that investors should place 5% to 10% of their assets in gold. According to Dalio, it makes sense to own gold as a hedge against current geopolitical risks. Two key ones include: The chance Congress won’t raise the debt ceiling, causing a technical default and leading to a",
    "publication_date": "2017-08-17T20:00:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.0151976,
          "label": "positive"
        }
      }
    },
    "title": "Is This a New Bull Market in Gold?"
  }, {
    "id": "77qPLBsaJRbg1iUzgRjPYS28qO4zebjAdIrNaqdr56Uj3wcJJZHM1c-_KgwwZoQW",
    "score": 3.2256498,
    "url": "http://www.bangkokpost.com/business/gold/1307812/gold-prices-up-b200-to-b20-250",
    "host": "bangkokpost.com",
    "text": "Gold prices up B200 to B20,250 17 Aug 2017 at 09:35 22 viewed 0 comments WRITER: ONLINE REPORTERS - + The Gold Traders Association this morning announced the buying prices at 19,783.80 baht per baht-weight for gold ornaments and 20,150 baht per baht-weight for gold bar. The selling prices were set at 20,750 baht per baht-weight for gold ornaments, and 20,250 baht per baht-weight for gold bar. The prices were up 200 baht from Wednesday’s close. The buying prices closed on Wednesday at 19,586.72 baht per baht-weight for gold ornaments and 19,950 baht per baht-weight for gold bar. The selling prices closed at 20,550 baht per baht-weight for gold ornaments and 20,050 baht per baht-weight for gold bar. RECOMMENDED STORIES",
    "publication_date": "2017-08-17T02:35:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.0120358,
          "label": "positive"
        }
      }
    },
    "title": "Gold prices up B200 to B20,250"
  }, {
    "id": "LxWqBPg-mVmqwIyPJ3DijbZ694UOxNoOayUKKjkkqwQzL5Kd3tjvY1ZD9FOGLIr8",
    "score": 3.0146317,
    "url": "https://rinconhillneighbors.org/2017/08/17/kinross-gold-corporation-kgc-price-target-increased-to-6-00-by-analysts-at-td-securities-updated.html",
    "host": "rinconhillneighbors.org",
    "text": "Tweet Kinross Gold Corporation (NYSE:KGC) (TSE:K) had its target price upped by analysts at TD Securities from $5.50 to $6.00 in a report issued on Thursday, August 3rd. The firm currently has an “action list buy” rating on the mining company’s stock. TD Securities’ price objective would indicate a potential upside of 36.99% from the company’s current price. Other equities analysts have also issued reports about the company. BMO Capital Markets raised Kinross Gold Corporation from a “market perform” rating to a “buy” rating and lifted their price objective for the stock from $3.75 to $5.00 in a research note on Monday, May 29th. Bank of America Corporation raised Kinross Gold Corporation from a “neutral” rating to a “buy” rating in a research note on Tuesday, May 23rd. Jefferies Group LLC set a $4.00 price objective on Kinross Gold Corporation and gave the stock a “hold” rating in a research",
    "publication_date": "2017-08-17T09:25:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.259033,
          "label": "positive"
        }
      }
    },
    "title": "TD Securities Increases Kinross Gold Corporation (KGC) Price Target to $6.00"
  }, {
    "id": "7k-8tJ6s7Qt6HQasxw1xXk8ASedXxxPBiv604gUqLFtsU12kn1Pv04nyYWa26GWB",
    "score": 2.962087,
    "url": "https://www.dailypolitical.com/2017/08/17/kinross-gold-corporation-kgc-shares-sold-by-alps-advisors-inc.html",
    "host": "dailypolitical.com",
    "text": "Tweet Alps Advisors Inc. reduced its stake in Kinross Gold Corporation (NYSE:KGC) (TSE:K) by 23.9% during the second quarter, according to its most recent Form 13F filing with the SEC. The firm owned 1,915,722 shares of the mining company’s stock after selling 601,716 shares during the period. Alps Advisors Inc.’s holdings in Kinross Gold Corporation were worth $7,797,000 as of its most recent filing with the SEC. Several other large investors also recently bought and sold shares of KGC. IFP Advisors Inc raised its position in shares of Kinross Gold Corporation by 22.0% in the second quarter. IFP Advisors Inc now owns 38,769 shares of the mining company’s stock valued at $158,000 after buying an additional 7,000 shares during the last quarter. Creative Planning raised its position in shares of Kinross Gold Corporation by 42.7% in the first quarter. Creative Planning now owns 38,921 shares of the mining company’s stock",
    "publication_date": "2017-08-17T14:18:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.274245,
          "label": "positive"
        }
      }
    },
    "title": "Kinross Gold Corporation (KGC) Shares Sold by Alps Advisors Inc."
  }, {
    "id": "QUdjRB85EaHyZaKQ23SoIR2GAZFswD6NTDn8WM1llrvlTAXzQCfC19jYxNgIhliz",
    "score": 2.9186988,
    "url": "http://www.stockmarketwire.com/article/5632422/Shanta-Gold-revenue-drops-by-5-point-2pct.html",
    "host": "stockmarketwire.com",
    "text": "Shanta Gold revenue drops by 5.2% 18 August 2017 | 08:01am StockMarketWire.com - Shanta Gold's revenue fell by 5.2% from $55.7 million to $52.7 million in the first half of the year. The company said this reflected lower gold sales as a result of the availability of lower grades than the previous year. The cost of sales amounted to $44 million, down 11.9% from the prior year, including the effect of accounting for underground development ore prior to commercial production. EBITDA was $21.5 million, down from $33.3 million, which was a record result based on high gold production as the Bauhinia Creek open pit returned high grades in the final few months of its life in 2016. The company made a loss before tax of $600,000, an improvement from a loss of $3 million the year before. The effect of accounting for underground development ore prior to commercial production reduced",
    "publication_date": "2017-08-18T07:01:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.375375,
          "label": "negative"
        }
      }
    },
    "title": "Shanta Gold revenue drops by 5.2%"
  }, {
    "id": "crCUUoZEBlfuf8EYV3Ssgc6r4BLZu1Rm1_G1Mb4KWypUPqH5KdkJlyHZs1E6KSXT",
    "score": 2.8657339,
    "url": "https://www.tickerreport.com/banking-finance/2829918/new-gold-inc-ngd-position-maintained-by-shell-asset-management-co.html",
    "host": "tickerreport.com",
    "text": "Tweet Shell Asset Management Co. continued to hold its stake in New Gold Inc. (NYSE:NGD) during the second quarter, according to its most recent 13F filing with the SEC. The institutional investor owned 54,000 shares of the company’s stock at the end of the second quarter. Shell Asset Management Co.’s holdings in New Gold were worth $222,000 as of its most recent filing with the SEC. Several other hedge funds also recently added to or reduced their stakes in the company. AQR Capital Management LLC increased its stake in New Gold by 35.7% in the fourth quarter. AQR Capital Management LLC now owns 47,752 shares of the company’s stock valued at $168,000 after buying an additional 12,572 shares during the period. Norges Bank bought a new stake in New Gold during the fourth quarter valued at about $11,605,000. Hexavest Inc. increased its stake in New Gold by 1,772.7% in the",
    "publication_date": "2017-08-18T08:04:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.263896,
          "label": "positive"
        }
      }
    },
    "title": "New Gold Inc. (NGD) Position Maintained by Shell Asset Management Co."
  }, {
    "id": "67IEg7mfN-vdumaJhLyHr-DzlXWtqW6owQ4r930ogxTQJM5OBC7R6bly7mpK7igk",
    "score": 2.8399749,
    "url": "https://www.watchlistnews.com/sandstorm-gold-ltd-sand-position-decreased-by-morgan-stanley/1499493.html",
    "host": "watchlistnews.com",
    "text": "Tweet Morgan Stanley decreased its stake in shares of Sandstorm Gold Ltd (NASDAQ:SAND) by 5.5% during the first quarter, Holdings Channel reports. The institutional investor owned 844,920 shares of the company’s stock after selling 49,522 shares during the period. Morgan Stanley’s holdings in Sandstorm Gold were worth $3,608,000 as of its most recent SEC filing. Several other hedge funds have also made changes to their positions in SAND. Van ECK Associates Corp increased its position in Sandstorm Gold by 11.7% in the first quarter. Van ECK Associates Corp now owns 28,972,293 shares of the company’s stock worth $123,712,000 after buying an additional 3,039,217 shares during the period. Great West Life Assurance Co. Can increased its position in Sandstorm Gold by 10.2% in the first quarter. Great West Life Assurance Co. Can now owns 8,623,922 shares of the company’s stock worth $36,779,000 after buying an additional 799,803 shares during the period.",
    "publication_date": "2017-08-17T15:56:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.0142865,
          "label": "positive"
        }
      }
    },
    "title": "Sandstorm Gold Ltd (SAND) Position Decreased by Morgan Stanley"
  }, {
    "id": "xMLGj-IL785qKLLzLcXTlk3iPuJD92ANBrIWlJeEKxHtyi7nrfnDwZIFfomwauXW",
    "score": 2.8257065,
    "url": "https://www.dailyfx.com/forex/fundamental/daily_briefing/daily_pieces/scalping_report/2017/08/17/Are-Gold-Prices-on-the-Verge-of-Fresh-Yearly-High.html",
    "host": "dailyfx.com",
    "text": "Gold responds to slope support – prices eying yearly highs Check out our Gold quarterly Gold 240min Chart Technical Outlook: Gold prices have been trading within the confines of a well-defined ascending channel formation with prices rebounding sharply off monthly open support this week at 1268 . The immediate advance is vulnerable while below 1293/95 - a region defined by the 2017 high-day close & the yearly stretch highs. That said, the near-term outlook remains weighted o the topside while within this channel with a breach above resistance targeting the upper parallel / May high at 1303 backed by the 78.6% retracement at 1321 . Bullish invalidation is now raised to 1274 with a break below the monthly on 1268 needed to shift the broader focus lower. A summary of IG Client Sentiment shows traders are net-long Gold- the ratio stands at +1.67 (62.6% of traders are long) – bearish",
    "publication_date": "2017-08-17T17:31:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.0696564,
          "label": "positive"
        }
      }
    },
    "title": "Are Gold Prices on the Verge of Fresh Yearly Highs?"
  }, {
    "id": "AxSRIGs9rnNxOfgzl5fHTjdbVAya4bLeFtgBkRkgZe0KwZOtm1NDL74-kFWs4ZFM",
    "score": 2.8081126,
    "url": "http://www.businessworldghana.com/gold-fields-sees-sharp-drop-profit-still-pays-dividend/",
    "host": "businessworldghana.com",
    "text": "Homepage » Company News » Gold Fields sees sharp drop in profit, but still pays dividend Gold Fields sees sharp drop in profit, but still pays dividend in Company News Gold Fields declared an interim dividend of 40c per share despite a sharp drop in interim profit, with the South Deep mine’s difficulties in the period a blot on the company’s overall operating performance. Gold Fields recorded net profit of $58.6m for the six months to end-June compared with net profit of $121m a year earlier. Revenue was little changed at $1.33bn, while operating profit fell to $627m from $639m. Gold output for the period increased slightly to 1.047-million ounces, with South Deep in SA and the Darlot mine in Australia producing less gold. Darlot has since been sold. The full-year production forecast was kept steady at between 2.1-million and 2.15-million ounces, with the all-in costs for the year shooting",
    "publication_date": "2017-08-17T08:24:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.250724,
          "label": "negative"
        }
      }
    },
    "title": "Gold Fields sees sharp drop in profit, but still pays dividend"
  }, {
    "id": "PfGgqdsevYy3U-ufoqt9_1zaDvyk5iVpvZX4N8204ExLVYspOk0mXofakgFU0mvJ",
    "score": 2.7058861,
    "url": "http://markets.financialcontent.com/stocks/news/read/34782882/The_Last_Time_Our_‘Gold_Direction_Indicator’_Was_As_Positive_As_Today",
    "host": "markets.financialcontent.com",
    "text": "By: Blogs - TalkMarkets August 17, 2017 at 18:59 PM EDT The Last Time Our ‘Gold Direction Indicator’ Was As Positive As Today, Gold Rose From $1220 To $1280 The stage is set for a possible upside breakout in the price of gold and mining stocks, and the seasonal trends are in support.",
    "publication_date": "2017-08-17T22:59:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.930003,
          "label": "positive"
        }
      }
    },
    "title": "The Last Time Our ‘Gold Direction Indicator’ Was As Positive As Today, Gold Rose From $1220 To $1280"
  }, {
    "id": "b8LhRvRZlt1xcG4FCIJFaoD0j1z_kOMw3BFFcKm79_FgG1WzFsZAGaHkTujWTwBe",
    "score": 2.6348722,
    "url": "http://news.goldseek.com/GoldForecaster/1503000300.php",
    "host": "news.goldseek.com",
    "text": "Golds future confiscation is a growing reality, as currency confidence slides! Part 6 This article is from previous articles featured in the Gold Forecaster weekly issues. [ Subscribe: www.GoldForecaster.com ] The subject of golds confiscation has come onto our screens again, but this time, being described as a Myth in the future. This thought comes from Canada, a favorite place for U.S. citizens to store their gold in the hopes that it will be outside the reach of the U.S. Federal Reserve. We respond to the article that described it as a myth, because we are firmly of the opinion that as we move from dollar hegemony to a multi currency, world currencies will find themselves competing against each other [race to the bottom] and increase the prospects for the confiscation of gold held in storage companies and by dealers as well as making such dealing illegal again. This makes",
    "publication_date": "2017-08-17T20:05:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.240001,
          "label": "negative"
        }
      }
    },
    "title": "Gold’s future confiscation is a growing reality, as currency confidence slides! – Part 6"
  }, {
    "id": "43iic-JhT6EfBMnkjhNBbYJR5kRRHqHCuXXujaRuJ6phTVcu7xSVRv-nDu7LWAGH",
    "score": 2.6098323,
    "url": "https://www.americanbankingnews.com/2017/08/17/centerra-gold-inc-cg-price-target-cut-to-c8-25.html",
    "host": "americanbankingnews.com",
    "text": "Tweet Centerra Gold Inc. (TSE:CG) had its target price decreased by analysts at National Bank Financial from C$8.50 to C$8.25 in a report released on Thursday. The brokerage currently has an “outperform” rating on the stock. National Bank Financial’s target price would suggest a potential upside of 16.53% from the stock’s previous close. A number of other equities analysts also recently issued reports on the company. BMO Capital Markets reaffirmed a “market perform” rating and set a C$8.00 price target on shares of Centerra Gold in a research report on Monday, July 10th. TD Securities reaffirmed a “hold” rating and set a C$7.50 price target on shares of Centerra Gold in a research report on Wednesday, May 3rd. Royal Bank Of Canada reaffirmed an “underperform” rating on shares of Centerra Gold in a research report on Tuesday, May 2nd. Finally, Scotiabank reaffirmed a “sector perform” rating and set a C$8.00",
    "publication_date": "2017-08-17T18:56:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.168085,
          "label": "negative"
        }
      }
    },
    "title": "Centerra Gold Inc. (CG) Price Target Cut to C$8.25"
  }, {
    "id": "9m6e8sb0VOuEIb_T8gvhgmIE7hmyMu2FIPFVPXAV90NkdbMxam0Q2Zk1_JYHyjiL",
    "score": 2.5925267,
    "url": "https://www.americanbankingnews.com/2017/08/17/galane-gold-ltd-gg-price-target-cut-to-c19-00-by-analysts-at-royal-bank-of-canada.html",
    "host": "americanbankingnews.com",
    "text": "Tweet Galane Gold Ltd (CVE:GG) had its price target decreased by analysts at Royal Bank Of Canada to C$19.00 in a report released on Thursday, StockTargetPrices.com reports. The brokerage presently has a “sector perform” rating on the stock. Separately, Scotiabank reiterated an “outperform” rating and issued a C$26.00 target price on shares of Galane Gold in a report on Thursday, April 27th. Get Galane Gold Ltd alerts: About Galane Gold Galane Gold Ltd. is a Canada-based gold producer and explorer. The Company operates through exploration, development and operation of gold mining properties segment. The Company has material properties, including the Mupane Property and the Galaxy Gold Mine, and several other prospective mineral properties. Galane Gold Ltd Galane Gold Ltd",
    "publication_date": "2017-08-17T19:38:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.415273,
          "label": "negative"
        }
      }
    },
    "title": "Galane Gold Ltd (GG) Price Target Cut to C$19.00 by Analysts at Royal Bank Of Canada"
  }, {
    "id": "Yre9Vid4NymeN6vI97y7yu-RogRKJg-njDnHCXrJHqEInyOKBvgWIAtO6PZCMqFn",
    "score": 2.4997864,
    "url": "https://www.dailypolitical.com/2017/08/17/yamana-gold-inc-auy-stake-raised-by-creative-planning.html",
    "host": "dailypolitical.com",
    "text": "Tweet Creative Planning increased its stake in Yamana Gold Inc. (NYSE:AUY) (TSE:YRI) by 76.6% during the second quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The institutional investor owned 45,638 shares of the basic materials company’s stock after buying an additional 19,795 shares during the period. Creative Planning’s holdings in Yamana Gold were worth $111,000 at the end of the most recent quarter. Several other institutional investors also recently modified their holdings of AUY. World Asset Management Inc raised its position in shares of Yamana Gold by 2.2% in the first quarter. World Asset Management Inc now owns 59,847 shares of the basic materials company’s stock valued at $165,000 after buying an additional 1,308 shares in the last quarter. Sumitomo Mitsui Trust Holdings Inc. raised its position in shares of Yamana Gold by 1.3% in the first quarter. Sumitomo Mitsui Trust Holdings Inc. now",
    "publication_date": "2017-08-17T16:18:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": 0.32601,
          "label": "positive"
        }
      }
    },
    "title": "Yamana Gold Inc. (AUY) Stake Raised by Creative Planning"
  }, {
    "id": "QdNOPR8GBLxnifrDDH3JgXbeJsSf_6uhi9UWh1-lkOUx4GVPkq8JSszdj9pZwPh7",
    "score": 2.4530604,
    "url": "http://news.morningstar.com/all/dow-jones/foreign-markets/201708171205/gold-fields-1h17-profit-down-54-at-53-million-update.aspx",
    "host": "news.morningstar.com",
    "text": "By Alexandra Wexler JOHANNESBURG--South African mining company Gold Fields Ltd. (GFI.JO) said Thursday that profit tumbled during the first half of 2017, due to a stronger rand, an increase in amortization and reinvestment in its mines. The world's eighth-largest gold producer said profit for the half fell 54% from a year earlier to $53 million. The higher amortization was due in large part to lower reserve ounces at the company's Tarkwa mine, while a stronger South African rand against the U.S. dollar, which gold is priced in, also hurt profit. In addition, earnings were impacted by nonrecurring items, including a $30.2 million provision for an ongoing silicosis lawsuit brought against many of South Africa's largest mining companies. The company's headline earnings per share, which strips out certain exceptional and one-off items, fell to 9 cents from 15 cents a year earlier. Gold Fields, which mines in South Africa, Ghana, Peru",
    "publication_date": "2017-08-17T00:00:00-05:00",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.603067,
          "label": "negative"
        }
      }
    },
    "title": "Gold Fields 1H17 Profit Down 54% at $53 Million -- Update"
  }, {
    "id": "u2Q8ItsFSNdzKsaKFGrosLenfmMu6sM5J_X28KjXLyrlwin2IvTTpJOcghjXJRqj",
    "score": 2.4530604,
    "url": "http://news.morningstar.com/all/dow-jones/africa-mideast/201708171205/gold-fields-1h17-profit-down-54-at-53-million-update.aspx",
    "host": "news.morningstar.com",
    "text": "By Alexandra Wexler JOHANNESBURG--South African mining company Gold Fields Ltd. (GFI.JO) said Thursday that profit tumbled during the first half of 2017, due to a stronger rand, an increase in amortization and reinvestment in its mines. The world's eighth-largest gold producer said profit for the half fell 54% from a year earlier to $53 million. The higher amortization was due in large part to lower reserve ounces at the company's Tarkwa mine, while a stronger South African rand against the U.S. dollar, which gold is priced in, also hurt profit. In addition, earnings were impacted by nonrecurring items, including a $30.2 million provision for an ongoing silicosis lawsuit brought against many of South Africa's largest mining companies. The company's headline earnings per share, which strips out certain exceptional and one-off items, fell to 9 cents from 15 cents a year earlier. Gold Fields, which mines in South Africa, Ghana, Peru",
    "publication_date": "2017-08-17T00:00:00-05:00",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.603067,
          "label": "negative"
        }
      }
    },
    "title": "Gold Fields 1H17 Profit Down 54% at $53 Million -- Update"
  }, {
    "id": "MOEcUbm67anBLToo2Z1gwhknyjCGYPIYS_9INGIbSAUpGlkVPUpEEKMDNwO36Hmi",
    "score": 2.4063306,
    "url": "https://www.dailyfx.com/forex/fundamental/daily_briefing/daily_pieces/commodities/2017/08/17/Gold-Prices-Rise-as-Trump-Break-With-CEO-Group-Cools-Fed-Outlook.html",
    "host": "dailyfx.com",
    "text": "Gold Prices Rise as Trump Break With CEO Group Cools Fed Outlook Thu Aug 17 07:33: Gold prices rise on Trump break with business leaders, FOMC minutes Crude oil prices drop as markets focus on gasoline, distillate inventories Are commodities matching DailyFX forecast so far in Q3? Find out here Gold prices rose as Fed rate hike expectations fizzled after US President Donald Trump broke with business leaders advising him via the S trategic and Policy Forum as well as the Manufacturing Council following his response to recent turmoil in Charlottesville, Virginia. The news tarnished hopes that the nascent Republican administration will be able to deliver on a pro-business agenda including infrastructure spending, deregulation and corporate tax cuts. Those policies were expected to boost inflation and push the central bank into a steeper tightening cycle. Minutes from July’s FOMC policy meeting likewise hurt the case for spirited stimulus withdrawal. The",
    "publication_date": "2017-08-17T07:33:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.553203,
          "label": "negative"
        }
      }
    },
    "title": "Gold Prices Rise as Trump Break With CEO Group Cools Fed Outlook"
  }, {
    "id": "GYwvGUQ1goPWo-HcepTDdSAR8DqAms-hTZb07LqeA-WeSDtizyWweqW1_7A4gZ33",
    "score": 2.3676715,
    "url": "https://www.watchlistnews.com/gold-fields-limited-gfi-earning-somewhat-favorable-news-coverage-report-finds/1501452.html",
    "host": "watchlistnews.com",
    "text": "Gold Fields Limited: Results for the Six Months Ended 30 June 2017 (finance.yahoo.com) GFI has been the subject of a number of analyst reports. Zacks Investment Research raised Gold Fields Limited from a “hold” rating to a “buy” rating and set a $4.00 price target for the company in a report on Tuesday, June 27th. BidaskClub downgraded Gold Fields Limited from a “buy” rating to a “hold” rating in a report on Friday, June 16th. Finally, Goldman Sachs Group, Inc. (The) raised Gold Fields Limited from a “sell” rating to a “neutral” rating and reduced their target price for the stock from $3.44 to $3.41 in a report on Thursday, June 29th. Four investment analysts have rated the stock with a sell rating, two have assigned a hold rating and two have given a buy rating to the company. Gold Fields Limited has an average rating of “Hold” and an",
    "publication_date": "2017-08-18T08:48:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.257781,
          "label": "negative"
        }
      }
    },
    "title": "Gold Fields Limited (GFI) Earning Somewhat Favorable News Coverage, Report Finds"
  }, {
    "id": "qpUanO--z-0aFmas9lnLZ570PxYE-VfB2CSUHR_p4KjHVac9c2OSPSpILwFUNkJ8",
    "score": 2.34694,
    "url": "https://rinconhillneighbors.org/2017/08/18/national-bank-financial-equities-analysts-increase-earnings-estimates-for-alamos-gold-inc-tseagi-updated.html",
    "host": "rinconhillneighbors.org",
    "text": "Tweet Alamos Gold Inc (TSE:AGI) (NYSE:AGI) – Equities research analysts at National Bank Financial increased their FY2017 earnings estimates for Alamos Gold in a note issued to investors on Thursday. National Bank Financial analyst M. Parkin now anticipates that the company will post earnings per share of $0.10 for the year, up from their previous forecast of $0.08. National Bank Financial has a “Outperform Market Weight” rating on the stock. National Bank Financial also issued estimates for Alamos Gold’s FY2018 earnings at $0.11 EPS, FY2019 earnings at $0.24 EPS and FY2020 earnings at $0.40 EPS. Get Alamos Gold Inc alerts: ILLEGAL ACTIVITY WARNING: “National Bank Financial Equities Analysts Increase Earnings Estimates for Alamos Gold Inc (TSE:AGI)” was first reported by Rincon Hill News and is owned by of Rincon Hill News. If you are reading this report on another publication, it was stolen and reposted in violation of US and",
    "publication_date": "2017-08-18T12:04:00Z",
    "enriched_text": {
      "sentiment": {
        "document": {
          "score": -0.350609,
          "label": "negative"
        }
      }
    },
    "title": "National Bank Financial Equities Analysts Increase Earnings Estimates for Alamos Gold Inc (TSE:AGI)"
  }]
}
